export const quizQuestions = {
  seerah: [
    {
      question: "من قائل: لا إله إلا أنت سبحانك إني كنت من الظالمين؟",
      answer: "يونس",
    },
    {
      question: "كيف كانت نهاية الملك الذي جادل إبراهيم؟",
      answer: "دخلت بعوضة في رأسه",
    },
    {
      question: "من هو الملك الذي جادل إبراهيم؟",
      answer: "النمرود",
    },
    {
      question: "كم سنة دعا نوح قومه؟",
      answer: "950",
    },
    {
      question: "في أي عام وُلد النبي محمد صلى الله عليه وسلم؟",
      answer: "عام الفيل",
    },
    {
      question: "من هو النبي ابن نبي ابن نبي ابن نبي؟",
      answer: "يوسف بن يعقوب بن إسحاق بن إبراهيم عليهم السلام",
    },
    {
      question: "ما المعجزة التي لا تزال موجودة حتى اليوم؟",
      answer: "القرآن الكريم",
    },
    {
      question: "من هو النبي الذي أُرسل إلى قوم مدين؟",
      answer: "شعيب",
    },
    {
      question: "من قتل أبا جهل؟",
      answer: "معاذ ومعوذ",
    },
    {
      question: "أين أُلقي النبي يوسف وهو صغير؟",
      answer: "في البئر",
    },
    {
      question: "ماذا قال الله للنار حين أُلقي فيها إبراهيم؟",
      answer: "كوني بردًا وسلامًا",
    },
    {
      question: "ما اسم الجبل الذي استقرت عليه سفينة نوح؟",
      answer: "الجودي",
    },
    {
      question: "كم عدد أبناء يعقوب عليه السلام؟",
      answer: "12",
    },
    {
      question: "ماذا ابتلع النبي يونس عليه السلام؟",
      answer: "الحوت",
    },
    {
      question: "بماذا ابتُلي النبي أيوب عليه السلام؟",
      answer: "المرض",
    },
    {
      question: "ما الشيء الذي أخرجه الله من الحجر لموسى؟",
      answer: "الماء",
    },
    {
      question: "أين وُضع موسى وهو رضيع؟",
      answer: "في التابوت بالنهر",
    },
    {
      question: "ما اسم الغار الذي نزل فيه الوحي على النبي محمد؟",
      answer: "حراء",
    },
    {
      question: "ماذا قال جبريل للنبي محمد عند أول وحي؟",
      answer: "اقرأ",
    },
    {
      question: "ماذا كان يعمل النبي محمد قبل النبوة؟",
      answer: "راعٍ وتاجر",
    },
  ],
};
